In [1]:
import pandas as pd

In [19]:
#reading dataset
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two','two',
                          'two'],
                  'bar': ['A','B','C','A','B','C'],
                  'baz':[1,2,3,4,5,6],
                  'zoo':['x','y','z','q','w','t']})

In [20]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [23]:
# pivoting
df.pivot(index='foo', columns='bar', values= 'baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [24]:
# pivoting
df.pivot(index='foo', columns='bar', values= ['baz','zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t